apps/load-tests/src/scenarios/heartbeats.yml
config:
  target: "ws://127.0.0.1:8080"
  processor: "../helpers/auth-hooks.ts" 
  http:
    pool: 100
  
  environments:
    smoke:
      phases:
        - duration: 60
          arrivalRate: 17
          name: "1k Users"
      variables:
        thinkTime: 30

    capacity:
      phases:
        - duration: 60
          arrivalRate: 50
          name: "3k Users"
      variables:
        thinkTime: 30

    endurance:
      phases:
        - duration: 60
          arrivalRate: 84
          name: "5k Users"
      variables:
        thinkTime: 30

    flood:
      phases:
        - duration: 60
          arrivalRate: 167
          name: "10k Users"
      variables:
        thinkTime: 60

    chaos:
      phases:
        - duration: 60
          arrivalRate: 200
          name: "12k Users"
      variables:
        thinkTime: 60

    extreme:
      phases:
        - duration: 60
          arrivalRate: 250
          name: "15k Users"
      variables:
        thinkTime: 60
        
    soak:
      phases:
        - duration: 120
          arrivalRate: 85
          name: "Ramp to 10k"
        - duration: 900
          arrivalRate: 167 
          name: "15-Minute Endurance Soak"
      variables:
        thinkTime: 60

scenarios:
  - engine: ws
    name: "Idle Connection"
    flow:
      - connect:
          target: "{{ target }}"
          function: "setupUser"
      - think: "{{ thinkTime }}"
      - function: "cleanupSession"