apps/load-tests/src/scenarios/matchmaking.yml
config:
  target: "ws://127.0.0.1:8080"
  processor: "../helpers/index.ts"
  http:
    pool: 100

  environments:
    smoke:
      phases:
        - duration: 60
          arrivalRate: 17
          name: "1k Users"
      variables:
        thinkTime: 15
        cronWaitTime: 125

    capacity:
      phases:
        - duration: 60
          arrivalRate: 50
          name: "3k Users"
      variables:
        thinkTime: 15
        cronWaitTime: 125

    endurance:
      phases:
        - duration: 60
          arrivalRate: 84
          name: "5k Users"
      variables:
        thinkTime: 15
        cronWaitTime: 125

    flood:
      phases:
        - duration: 60
          arrivalRate: 167
          name: "10k Users"
      variables:
        thinkTime: 25 
        cronWaitTime: 125

    chaos:
      phases:
        - duration: 60
          arrivalRate: 200
          name: "12k Users"
      variables:
        thinkTime: 30
        cronWaitTime: 125

    extreme:
      phases:
        - duration: 60
          arrivalRate: 250
          name: "15k Users"
      variables:
        thinkTime: 30
        cronWaitTime: 125
        
    soak:
      phases:
        - duration: 120
          arrivalRate: 85
          name: "Ramp to 10k"
        - duration: 900
          arrivalRate: 167 
          name: "15-Minute Matchmaking Soak"
      variables:
        thinkTime: 30
        cronWaitTime: 125

scenarios:
  - engine: ws
    name: "Vector Matchmaking Funnel"
    flow:
      - connect:
          target: "{{ target }}"
          function: "setupUser"
      - function: "joinMatchmakingQueue"
      - think: "{{ thinkTime }}"
      - think: "{{ cronWaitTime }}"
      - function: "cleanupSession"