apps/load-tests/src/scenarios/messaging.yml
config:
  target: "ws://127.0.0.1:8080"
  processor: "../helpers/index.ts"
  http:
    pool: 100

  environments:
    smoke:
      phases:
        - duration: 60
          arrivalRate: 17
          name: "1k Users"
      variables:
        messageCount: 5
        thinkTime: 2
        
    capacity:
      phases:
        - duration: 60
          arrivalRate: 50
          name: "3k Users"
      variables:
        messageCount: 10
        thinkTime: 1

    endurance:
      phases:
        - duration: 60
          arrivalRate: 84
          name: "5k Users"
      variables:
        messageCount: 10
        thinkTime: 1

    flood:
      phases:
        - duration: 60
          arrivalRate: 167
          name: "10k Users"
      variables:
        messageCount: 10
        thinkTime: 1

    chaos:
      phases:
        - duration: 60
          arrivalRate: 200
          name: "12k Users"
      variables:
        messageCount: 10
        thinkTime: 1

    extreme:
      phases:
        - duration: 60
          arrivalRate: 250
          name: "15k Users"
      variables:
        messageCount: 10
        thinkTime: 1

    soak:
      phases:
        - duration: 120
          arrivalRate: 85
          name: "Ramp to 10k"
        - duration: 900
          arrivalRate: 167 
          name: "15-Minute Messaging Soak"
      variables:
        messageCount: 10
        thinkTime: 2

scenarios:
  - engine: ws
    name: "Active Conversation Flow"
    flow:
      - connect:
          target: "{{ target }}"
          function: "setupUser"
      - think: 1
      - loop:
          - function: "generateMessagePayload"
          - send:
              type: "CHAT_MESSAGE"
              payload:
                connectionId: "{{ connectionId }}"
                receiverId: "{{ receiverId }}"
                content: "{{ chatMessage }}"
          - think: "{{ thinkTime }}"
        count: "{{ messageCount }}"
      - think: 10
      - function: "cleanupSession"